# Задача 18:
# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.
# Заполните массив случайными натуральными числами от 1 до N.
# Выведите, ближайший к X элемент. Если есть несколько элементов, которые равноудалены от X, выведите наименьший по величине.
# Ввод: 10
# Ввод: 7
# 1 2 1 8 9 6 5 4 3 4
# Вывод: 6

import random
import os
os.system('cls')

n = int(input('Какова будет длина массива? '))
a = []
for i in range(0, n):
    random_numbers = random.randint(1, n)
    a.append(random_numbers)
print(f'\033[35m{a}')

x = int(input('\033[37mКакое число будем сравнивать? '))
min = max = abs(x - a[0])
count = False
z = k = a[0]
for i in range(0,len(a)):
    if a[i] == x:
        count = True
        print(f'\033[31mЧисло {x} в заданном массиве бизко к себе самому. Ближе просто некуда!')
        break
    else:
        for j in range(1, len(a)):          
            if a[j] > x and (a[j] - x) < max:
                max = a[j] - x
                z = a[j]
            elif a[j] < x and (x - a[j]) < min:
                min = x - a[j]
                k = a[j]

if count == False:
    if max < min:
        print(f'\033[36mСамым близким числом к {x} оказалось число {z}.')
    elif max == min:
        print(f'\033[32mЧто число {k}, что число {z} одинаково близки к {x}, поэтому выбирайте любое!')
    else:
        print(f'\033[36mСамым близким числом к {x} оказалось число {k}.')


