# Задача 16:
# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.
# Заполните массив случайными натуральными числами от 1 до N/2.
# Выведите, сколько раз X встречается в массиве.
# Ввод: 5
# Ввод: 1
# 1 2 1 2 2
# Вывод: 2

import random
import os
os.system('cls')

n = int(input('Сколько будет элементов в массиве?  '))
a = []
for i in range(0, n):
    random_numbers = random.randint(1, round(n/2))
    a.append(random_numbers)
print(f'\033[33m{a}')

x = int(input('Введите число для проверки:  '))
count = 0
for j in a:
    if j == x:
        count += 1
    
if count == 0: print('\033[31mТакого числа в массиве нет. Думали мы об этом не скажем? ')
else: print(f'\033[32mЧисло {x} встречается в массиве всего {count} раз(-а)! А вот Комета Галлея встречается всего 1 раз в 75 лет! (ждите в 2061 году).')